# THIS FILE IS AUTOMATICALLY GENERATED
# Project: E:\GIT Hub Project\protocov\Protocov\Protocov.cydsn\Protocov.cyprj
# Date: Wed, 01 Nov 2023 00:18:52 GMT
#set_units -time ns
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 12.681159420289854 -waveform {0 6.34057971014493} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 12.681159420289854 -waveform {0 6.34057971014493} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {ClockVehicleBattVoltageADC} -source [get_pins {ClockBlock/clk_sync}] -edges {1 61 123} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_generated_clock -name {BluetoothUART_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 513 1027} [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/clk_sync}] -edges {1 7 13} -nominal_period 83.333333333333329 [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 15 33} -nominal_period 208.33333333333331 [list [get_pins {ClockBlock/dclk_glb_1}]]


# Component constraints for E:\GIT Hub Project\protocov\Protocov\Protocov.cydsn\TopDesign\TopDesign.cysch
# Project: E:\GIT Hub Project\protocov\Protocov\Protocov.cydsn\Protocov.cyprj
# Date: Wed, 01 Nov 2023 00:18:47 GMT
